
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОплатаОтПассажиров.Записывать = Истина;
	Движение = Движения.ОплатаОтПассажиров.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Автомобиль = Автомобиль;
	Движение.Сумма = Сумма;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.Регистратор КАК ОбъектПерерасчета,
		|	ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ДополнительныеНачисления.Автомобиль КАК Автомобиль,
		|	ДополнительныеНачисления.ВидРасчета КАК ВидРасчета
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления
		|ГДЕ
		|	ДополнительныеНачисления.ПериодРегистрации = &ПериодРегистрации
		|	И ДополнительныеНачисления.Сотрудник = &Сотрудник
		|	И ДополнительныеНачисления.Автомобиль = &Автомобиль
		|	И ДополнительныеНачисления.ВидРасчета = &ВидРасчета
		|ИТОГИ ПО
		|	ОбъектПерерасчета";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", КонецМесяца(Дата) + 1);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ДополнительныеНачисления.Надбавка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбъектПерерасчета = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОбъектПерерасчета.Следующий() Цикл
		
		Перерасчет = РегистрыРасчета.ДополнительныеНачисления.Перерасчеты.ПерерасчетНадбавки.СоздатьНаборЗаписей();
		Перерасчет.Отбор.ОбъектПерерасчета.Установить(ВыборкаОбъектПерерасчета.ОбъектПерерасчета);
		Перерасчет.Прочитать();
		
		ВыборкаДетальныеЗаписи = ВыборкаОбъектПерерасчета.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НовСтр = Перерасчет.Добавить();	
			ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
			
		КонецЦикла;
		
		ТЗ = Перерасчет.Выгрузить();
		ТЗ.Свернуть("ОбъектПерерасчета, ВидРасчета, Сотрудник, Автомобиль");   
		Если ТЗ.Количество() <> Перерасчет.Количество() Тогда
			Перерасчет.Очистить();
			Перерасчет.Загрузить(ТЗ);
		КонецЕсли;
		
		Перерасчет.Записать();
		
	КонецЦикла;
	

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
