
&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", Объект.Склад);
	ПараметрыФормы.Вставить("ТипЦен", Объект.ТипЦен);
	ПараметрыФормы.Вставить("ДатаДок", Объект.Дата);
	
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ОбработатьВыборНоменклатуры", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,ОбработчикЗакрытия,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовСтр = Объект.СписокНоменклатуры.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтр, Результат, "Номенклатура, Цена");
	НовСтр.Количество = 1;
	
КонецПроцедуры
