
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ПотребностиЗаказаПокупателя.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаказПокупателяСписокНоменклатуры.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаказПокупателя.СписокНоменклатуры КАК ЗаказПокупателяСписокНоменклатуры
		|ГДЕ
		|	ЗаказПокупателяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяСписокНоменклатуры.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ПотребностиЗаказаПокупателя.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.ЗаказПокупателя = Ссылка;
		Движение.КоличествоЗаказать = ВыборкаДетальныеЗаписи.Количество;
		Движение.КоличествоОтгрузить = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
