Функция ПредставлениеПартии(Партия, Номер, Дата) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Партия) Тогда
		Возврат "";
	КонецЕсли;
	
	Ном = Строка(Номер);
	НомПредставление = "";
	Для сч = 1 По СтрДлина(Ном) Цикл
		Символ = Сред(Ном, сч, 1);
		Если Символ = "0" Тогда
			Продолжить;
		ИНаче
			НомПредставление = НомПредставление + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(Партия) = Тип("ДокументСсылка.ПриходнаяНакладная")  Тогда
		Представление = "ПН №" + НомПредставление + " от " + Формат(Дата, "ДФ=dd.MM.yyyy");	
	Иначе
		Представление = "УУП №" + НомПредставление + " от " + Формат(Дата, "ДФ=dd.MM.yyyy");	
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПредставлениеДокументаБУ(Документ, Номер) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Возврат "";
	КонецЕсли;
	
	Ном = Строка(Номер);
	НомПредставление = "";
	Для сч = 1 По СтрДлина(Ном) Цикл
		Символ = Сред(Ном, сч, 1);
		Если Символ = "0" Тогда
			Продолжить;
		ИНаче
			НомПредставление = НомПредставление + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РасходнаяНакладная")  Тогда
		Представление = "Расходная Накладная №" + НомПредставление;	
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходДенег")  Тогда
		Представление = "Приход денег №" + НомПредставление;	
	Иначе
		Представление = "Корректировка долга №" + НомПредставление;	
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции