
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьКарту(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКарту(ТекущийОбъект)
	Карта = ТекущийОбъект.ПолучитьКартуМаршрута();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьКарту(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьКартуМаршрута" Тогда
		ОбновитьКартуМаршрута(Параметр);	
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуМаршрута(БизнесПроцессЗадачи)
	
	Если БизнесПроцессЗадачи = Объект.Ссылка Тогда
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");
		ОбновитьКарту(ТекущийОбъект);
		ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	КонецЕсли;
	
КонецПроцедуры
