
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РабочееВремяСотрудников
	Движения.РабочееВремяСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаДанныеТабеля Из ДанныеТабеля Цикл
		
		Для сч = 1 По 31 Цикл
			
			ИмяКолонки = "_" + сч;
			Если НЕ ЗначениеЗаполнено(ТекСтрокаДанныеТабеля[ИмяКолонки]) Тогда
				Продолжить;
			ИначеЕсли ТекСтрокаДанныеТабеля[ИмяКолонки] = "8К" Тогда 
				ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Коммандировка;
			Иначе
				ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Оклад;
			КонецЕсли;
			
			Движение = Движения.РабочееВремяСотрудников.Добавить();
			Движение.Период = ДатаРегистрации + (сч - 1) * 24 * 60 * 60;
			Движение.Сотрудник = ТекСтрокаДанныеТабеля.Сотрудник;
			Движение.Подразделение = Подразделение;
			
			Движение.ВидРасчета = ВидРасчета;
			Движение.Значение = 8;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатаРегистрации = НачалоМесяца(ДатаРегистрации);
	
КонецПроцедуры


