
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
		
		ИмяПользователя = ИмяПользователя(); 
		
		ПользовательБД = Справочники.ФизическиеЛица.НайтиПоНаименованию(ИмяПользователя);
		
		Если НЕ ЗначениеЗаполнено(ПользовательБД) Тогда
			
			ОбъектБД = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ОбъектБД.Код = ИмяПользователя;
			ОбъектБД.Наименование = ИмяПользователя;
			
			ОбъектБД.Записать();
			
		КонецЕсли;
		
		ПараметрыСеанса.ТекущийПользователь = ПользовательБД;
		
	КонецЕсли;
	
КонецПроцедуры
