
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РабочееВремяСотрудников.Записывать = Истина;
	ЧислоСекундВСутках = 86400;
	Для Каждого ТекСтрокаОтработанноеВремя Из ОтработанноеВремя Цикл
		
		ДатаНачала = НачалоМесяца(ПериодРегистрации);
		Для сч = 1 По 31 Цикл
			
			ИмяКолонки = "_" + Формат(сч, "ЧГ=");
			Если ТекСтрокаОтработанноеВремя[ИмяКолонки] = "8" Тогда
				Движение = Движения.РабочееВремяСотрудников.Добавить();
				Движение.Период = ДатаНачала + (сч-1) * ЧислоСекундВСутках;
				Движение.Сотрудник = ТекСтрокаОтработанноеВремя.Сотрудник;
				Движение.Подразделение = Подразделение;
				Движение.Значение = 8;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
