
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаПоДокументу = 0;
	Для каждого СтрокаТЧ ИЗ СписокНоменклатуры Цикл
		
		Если СТрокаТЧ.НеХватает > СтрокаТЧ.Количество Тогда
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Количество отгрузке меньше, чем не хватает в строке: %1", СтрокаТЧ.НомерСтроки);
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		Если СтрокаТЧ.НеХватает = 0 Тогда
			СуммаПоДокументу = СуммаПоДокументу + СтрокаТЧ.Сумма;
		Иначе
			СуммаПоДокументу = СуммаПоДокументу + (СтрокаТЧ.Количество - СтрокаТЧ.НеХватает) * СтрокаТЧ.Цена;
		 КонецЕсли;
		 
		 
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОтгрузкиТоваров.Записывать = Истина;
	
	Движения.ЗадолженностиПокупателей.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
		|	РасходнаяНакладнаяСписокНоменклатуры.Цена КАК Цена,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК Сумма,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.НеХватает) КАК НеХватает
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
		|	РасходнаяНакладнаяСписокНоменклатуры.Цена";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОтгрузкиТоваров.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Отгружено = Выборка.Количество;
		Движение.ОтгруженоСумма = Выборка.Сумма;
		Движение.Получено = Движение.Отгружено - Выборка.НеХватает;
		Движение.ПолученоСумма = Движение.ОтгруженоСумма - Выборка.НеХватает * Выборка.Цена;
	КонецЦикла;

	Движение = Движения.ЗадолженностиПокупателей.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Документ = Ссылка;
	Движение.Сумма = СуммаПоДокументу;

	Движения.ЗадолженностиПокупателей.БлокироватьДляИзменения = Истина;
	Движения.ЗадолженностиПокупателей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадолженностиПокупателейОстатки.Документ КАК Документ,
		|	-ЗадолженностиПокупателейОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПокупателей.Остатки(, Документ = &Ссылка) КАК ЗадолженностиПокупателейОстатки
		|ГДЕ
		|	ЗадолженностиПокупателейОстатки.СуммаОстаток < 0";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Возника отрицательная задолженность на сумму: " + ВыборкаДетальныеЗаписи.СуммаОстаток;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры
