
&НаСервереБезКонтекста
Процедура заполнитьНаСервере()

	Набор = РегистрыСведений.РегистрАдресации.СоздатьНаборЗаписей();
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.Бухгалтерия;
	Запись.Должность = Справочники.Должности.Кассир;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Васина;
	
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.Бухгалтерия;
	Запись.Должность = Справочники.Должности.Кассир;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Мишина;
	
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.Бухгалтерия;
	Запись.Должность = Справочники.Должности.Бухгалтер;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Мишина;
	
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.Бухгалтерия;
	Запись.Должность = Справочники.Должности.Бухгалтер;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Кротов;
	
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.Бухгалтерия;
	Запись.Должность = Справочники.Должности.ГлБухгалтер;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Иванов;
		
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.ОтделПродаж;
	Запись.Должность = Справочники.Должности.НачальникОтдела;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Хабибулин;
		
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.ОтделПродаж;
	Запись.Должность = Справочники.Должности.ЗамНачальникаОтдела;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Крамер;
	
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.ОтделПродаж;
	Запись.Должность = Справочники.Должности.Менеджер;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Галкин;
	
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.ОтделПродаж;
	Запись.Должность = Справочники.Должности.Менеджер;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Палкин;
	
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.ОтделПродаж;
	Запись.Должность = Справочники.Должности.Менеджер;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Малкин;

	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.ОтделПродаж;
	Запись.Должность = Справочники.Должности.Кладовщик;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Залкинд;
	
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.ОтделПродаж;
	Запись.Должность = Справочники.Должности.Кладовщик;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Лоханкина;
	
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.ОтделПродаж;
	Запись.Должность = Справочники.Должности.Кладовщик;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Жупиков;
	
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.ОтделПродаж;
	Запись.Должность = Справочники.Должности.Менеджер;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Рахимов;
	
	Запись = Набор.Добавить();
	Запись.Подразделение = Справочники.Подразделения.ОтделПродаж;
	Запись.Должность = Справочники.Должности.Менеджер;
	Запись.Исполнитель = Справочники.ФизическиеЛица.Мансуров;

	набор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура заполнить(Команда)
	заполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	Набор = РегистрыСведений.РегистрАдресации.СоздатьНаборЗаписей();
	Набор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры
