
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
		
		ТекПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		Имя = ТекПользовательИБ.Имя;
		
		ТекПользовательСпр = Справочники.ФизическиеЛица.НайтиПоНаименованию(Имя);
		Если НЕ ЗначениеЗаполнено(ТекПользовательСпр) Тогда
			
			ТекПользовательСпр = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ТекПользовательСпр.Наименование = Имя;
			ТекПользовательСпр.Записать();
			
		КонецЕсли;
		
		ПараметрыСеанса.ТекущееФизЛицо = ТекПользовательСпр.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры
