
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДатаРегистрации) Тогда
		Объект.ДатаРегистрации = НачалоМесяца(Объект.ДатаРегистрации);
	КонецЕсли;
	
	СекундВДне = 24*3600;
	
	Для сч = 1 По 31 Цикл
		
		ИмяКолонки = "ДанныеТабеля_" + сч;
		
		Элементы[ИмяКолонки].СписокВыбора.Добавить("8", "8");
		Элементы[ИмяКолонки].СписокВыбора.Добавить("8К", "8К");
		Элементы[ИмяКолонки].СписокВыбора.Добавить("", " ");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокКолонок()
	
	Если Не ЗначениеЗаполнено(Объект.ДатаРегистрации) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаРегистрации) И Объект.ДатаРегистрации <> НачалоМесяца(Объект.ДатаРегистрации) Тогда
		Объект.ДатаРегистрации = НачалоМесяца(Объект.ДатаРегистрации);
	КонецЕсли;
	
	СекундВДне = 24*3600;
	
	Для сч = 1 По 31 Цикл
		
		ИмяКолонки = "ДанныеТабеля_" + сч;
		
		ТекДата = Объект.ДатаРегистрации + (сч-1) * СекундВДне;   
		Если Месяц(Объект.ДатаРегистрации) <> Месяц(ТекДата) Тогда
			
			Элементы[ИмяКолонки].Доступность = Ложь;
		Иначе
			Элементы[ИмяКолонки].Доступность = Истина;
			НовыйЗаголовок = СтрШаблон("%1 (%2)", сч, ДеньНедели(ТекДата));
			Элементы[ИмяКолонки].Заголовок = НовыйЗаголовок;
		КонецЕсли;
	КонецЦикла;
	
	
	
КОнецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЗаголовокКолонок();
КонецПроцедуры

&НаКлиенте
Процедура ДатаРегистрацииПриИзменении(Элемент)
	ОБъект.ДанныеТабеля.Очистить();
	ОбновитьЗаголовокКолонок();
КонецПроцедуры



