Функция ПолучитьНеВыполненныеЗадания() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаЗадачиПоИсполнителю.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задача.ЗадачиПоИсполнителю КАК ЗадачаЗадачиПоИсполнителю
		|ГДЕ
		|	НЕ ЗадачаЗадачиПоИсполнителю.Выполнена
		|	И НЕ ЗадачаЗадачиПоИсполнителю.УжеПоказана";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	МасЗадач = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		МасЗадач.Добавить(Выборка.Ссылка);
		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗадачаОбъект.УжеПоказана = Истина;
		Попытка
			ЗадачаОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат МасЗадач;
	
КонецФункции
