
&НаКлиенте
Процедура ВыбратьФото(Команда)
	
	НачатьПомещениеФайлаНаСервер(
		Новый ОписаниеОповещения("ВыбратьФотоЗАвершение", ЭтаФорма),
		,
		,
		АдресКартинки,
		,
		УникальныйИдентификатор);
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВыбратьФотоЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено ИЛИ Результат.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	АдресКартинки = Результат.Адрес;
	Модифицированность = Истина;

КонецПроцедуры // ВыбратьФотоЗавершение()


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
	
		ТекущийОбъект.Изображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресКартинки));
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Изображение");
	
КонецПроцедуры



