
&НаСервере
Процедура СформироватьНаСервере()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеНачисленияФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
	|	ОсновныеНачисленияФактическийПериодДействия.Сотрудник КАК Сотрудник,
	|	ОсновныеНачисленияФактическийПериодДействия.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ОсновныеНачисленияФактическийПериодДействия.ПериодДействияКонец КАК ПериодДействияКонец
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ФактическийПериодДействия(
	|			ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
	|				И Подразделение = &ПОдразделение) КАК ОсновныеНачисленияФактическийПериодДействия";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДиаграммаГанта.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТекущаяТочка = ДиаграммаГанта.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудник);
		ТекущаяСерия = ДиаграммаГанта.УстановитьСерию(ВыборкаДетальныеЗаписи.ВидРАсчета);
		ТекущееЗначение = ДиаграммаГанта.ПолучитьЗначение(ТекущаяТочка, ТекущаяСерия);
		
		ТЕкущийИнтервал = ТекущееЗначение.Добавить();
		ТЕкущийИнтервал.Начало = ВыборкаДетальныеЗаписи.ПериодДействияНачало;
		ТЕкущийИнтервал.Конец = КонецДня(ВыборкаДетальныеЗаписи.ПериодДействияКонец);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
