
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаПоДокументу = СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	ОбработкаПроведенияОУ(Отказ, Режим);
КонецПроцедуры	


Процедура ОбработкаПроведенияОУ(Отказ, Режим)

	// Получаем Курс валюты на дату документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Проект.Валюта КАК Валюта,
		|	РасходнаяНакладная.Проект.Валюта.Представление КАК ВалютаПредставление
		|ПОМЕСТИТЬ ВТ_ВалютаПроектв
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВалютаПроектв.Валюта КАК Валюта,
		|	ВТ_ВалютаПроектв.ВалютаПредставление КАК ВалютаПредставление,
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) КАК Курс
		|ИЗ
		|	ВТ_ВалютаПроектв КАК ВТ_ВалютаПроектв
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&Период,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						ВТ_ВалютаПроектв.Валюта
		|					ИЗ
		|						ВТ_ВалютаПроектв КАК ВТ_ВалютаПроектв)) КАК КурсыВалютСрезПоследних
		|		ПО ВТ_ВалютаПроектв.Валюта = КурсыВалютСрезПоследних.Валюта";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Обходим выборку и если валюта не рубль то выдаем ошибку при нулевом курсе
		Если Выборка.Курс = 0 И Выборка.Валюта <> Справочники.Валюты.РоссийскийРубль Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для валюты " + Выборка.ВалютаПредставление + " не указан курс";;
			Сообщение.Сообщить();
		Иначе
			Курс = ?(Выборка.Курс = 0, 1, Выборка.Курс);
		КонецЕсли;
	КонецЦикла;
	
	// Проводим по старой методике
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Взаиморасчеты.Записать();
	
	//Устанавливаем блокировкуна регистр
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
	ЭлементБлокировки.УстановитьЗначение("Контрагент", Контрагент);
	ЭлементБлокировки.УстановитьЗначение("Проект", Проект);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	//Получаем аванс
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	-ВзаиморасчетыОстатки.СуммаРубОстаток КАК СуммаРуб
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты.Остатки(
		|			&МоментВремени,
		|			Контрагент = &Контрагент
		|				И Проект = &ПроектАванс) КАК ВзаиморасчетыОстатки
		|ГДЕ
		|	ВзаиморасчетыОстатки.СуммаРубОстаток <> 0";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("ПроектАванс", Справочники.Проекты.Аванс);
	
	РезультатЗапроса = Запрос.Выполнить();
	ОсталосьСписать  =  СуммаПоДокументу * Курс;
	СуммаСписания = 0;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		СуммаСписания = Мин(ОсталосьСписать, Выборка.СуммаРуб);
			
		//5.1 Формирование движнний. Уменьшение аванса
		Движение = Движения.Взаиморасчеты.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Проект = Справочники.Проекты.Аванс;
		Движение.СуммаРуб = СуммаСписания;
		Движение.СуммаВал = 0;
		
	КонецЕсли;
	
	//Формирование движений. Отражение долга
	ОсталосьСписать = ОсталосьСписать - СуммаСписания;
	Если ОсталосьСписать > 0 Тогда 
		Движение = Движения.Взаиморасчеты.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Проект = Проект;
		Движение.СуммаРуб = ОсталосьСписать;
		Движение.СуммаВал = ОсталосьСписать / Курс;
	КонецЕсли;	
	

КонецПроцедуры
