
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.НоменклатураВЭксплуатации.Записывать = Истина;
	Движения.НоменклатураВЭксплуатации.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НоменклатураВЭксплуатации");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураВЭксплуатацииОстатки.Номенклатура КАК Номенклатура,
		|	НоменклатураВЭксплуатацииОстатки.СрокГодности КАК СрокГодности,
		|	НоменклатураВЭксплуатацииОстатки.СрокЭксплуатации КАК СрокЭксплуатации,
		|	НоменклатураВЭксплуатацииОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	НоменклатураВЭксплуатацииОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.НоменклатураВЭксплуатации.Остатки(
		|			&МоментВремени,
		|			СрокГодности <= &СрокГодности
		|				ИЛИ СрокЭксплуатации <= &СрокЭксплуатации) КАК НоменклатураВЭксплуатацииОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("СрокГодности", Дата);
	Запрос.УстановитьПараметр("СрокЭксплуатации", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.НоменклатураВЭксплуатации.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.СрокГодности = ВыборкаДетальныеЗаписи.СрокГодности;
		Движение.СрокЭксплуатации = ВыборкаДетальныеЗаписи.СрокЭксплуатации;
		Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
		
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
