
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
	
		Имя = ИмяПользователя();
		
		ПользовательБД = Справочники.ФизическиеЛица.НайтиПоНаименованию(Имя);
		Если НЕ ЗначениеЗаполнено(ПользовательБД) Тогда
			
			ОбъектБД = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ОбъектБД.Код = Имя;
			ОбъектБД.Наименование = Имя;
			ОбъектБД.Записать();
			
			ПользовательБД = ОбъектБД.Ссылка;
		
		КонецЕсли;
		
		ПараметрыСеанса.ТекущийПользователь = ПользовательБД;
		
	КонецЕсли;
	
	
КонецПроцедуры
