Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, Смена) Экспорт 
	
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.Смена.Установить(Смена);
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	НомерДня = 0;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		НомерДня = НомерДня + 1;
		Если НомерДня > 3 Тогда
			НомерДня = 1;
		КонецЕсли;
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
		    Продолжить;
		ИначеЕсли Запись.Дата =Дат Тогда
			Если Найти(ВыходныеДни, Строка(НомерДня)) Тогда
				Запись.Значение = 0;
			Иначе	          
				Запись.Значение = 8;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Смена = Смена;
				НоваяЗапись.Дата = Дат;
				Если Найти(ВыходныеДни, Строка(НомерДня)) Тогда
					НоваяЗапись.Значение = 0;
				Иначе	          
					НоваяЗапись.Значение = 8;
				КонецЕсли; 
				Дат = Дат + ЧислоСекундВСутках;
			КонецЦикла; 
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Если Найти(ВыходныеДни, Строка(НомерДня)) Тогда
					Запись.Значение = 0;
				Иначе	          
					Запись.Значение = 8;
				КонецЕсли;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЕсли; 
		
	КонецЦикла;
	Набор.Записать();
	НомерДня = 0;
	Пока Дат <= ДатаОкончания Цикл
		
		НомерДня = НомерДня + 1;
		Если НомерДня > 3 Тогда
			НомерДня = 1;
		КонецЕсли;
		
		Запись = Набор.Добавить();
		Запись.Смена = Смена;
		Запись.Дата = Дат;
		Если Найти(ВыходныеДни, Строка(НомерДня)) Тогда
			Запись.Значение = 0;
		Иначе	          
			Запись.Значение = 8;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры
