
&НаСервере
Процедура ПересчитатьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоСотрудникуИПодразделению.ОбъектПерерасчета КАК ОбъектПерерасчета,
	|	ПоСотрудникуИПодразделению.Сотрудник КАК Сотрудник,
	|	ПоСотрудникуИПодразделению.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисления.ПоСотрудникуИПодразделению КАК ПоСотрудникуИПодразделению
	|ИТОГИ ПО
	|	ОбъектПерерасчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбъектПерерасчета = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОбъектПерерасчета.Следующий() Цикл
		
		ДокументКПерерасчету = ВыборкаОбъектПерерасчета.ОбъектПерерасчета;
		
		ВыборкаДетальныеЗаписи = ВыборкаОбъектПерерасчета.Выбрать();
		
		ДопОтбор = Новый Структура("Сотрудники, Подразделения", Новый Массив, Новый Массив);
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДопОтбор.Сотрудники.Добавить(ВыборкаДетальныеЗаписи.Сотрудник);
			ДопОтбор.Подразделения.Добавить(ВыборкаДетальныеЗаписи.Подразделение);
			
		КонецЦикла;
		
		ДополнительныеНачисления = РегистрыРасчета.ДополнительныеНачисления.СоздатьНаборЗаписей();
		ДополнительныеНачисления.Отбор.Регистратор.Установить(ДокументКПерерасчету);
		ДополнительныеНачисления.Прочитать();
		
		Расчет.РассчитатьКомпенсацию(ДокументКПерерасчету, ДополнительныеНачисления, ДопОтбор);
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Пересчитать(Команда)
	ПересчитатьНаСервере();
	СкомпоноватьРезультат();
КонецПроцедуры
