
Процедура ОбработкаПроведения(Отказ, Режим)
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ПеремещениеСписокНоменклатуры.Количество) КАК КоличествоДок
		|ПОМЕСТИТЬ ВТ_ДанныеДок
		|ИЗ
		|	Документ.Перемещение.СписокНоменклатуры КАК ПеремещениеСписокНоменклатуры
		|ГДЕ
		|	ПеремещениеСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеСписокНоменклатуры.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = МВТ.Таблицы[0].ПолучитьДанные().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Отдел = ОтделЗакупа;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоДок;

		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Отдел = ТорговаяТочка;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоДок;
		
	КонецЦикла;
	
	Движения.ОстаткиНоменклатуры.БлокироватьДляИзменения = Истина;
	Движения.ОстаткиНоменклатуры.Записать();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|			&Граница,
	|			Отдел = &Отдел
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеДок.Номенклатура
	|					ИЗ
	|						ВТ_ДанныеДок)) КАК ОстаткиНоменклатурыОстатки
	|ГДЕ
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
	
	Если ЗначениеЗаполнено(Основание) Тогда
		Запрос.УстановитьПараметр("Граница", Новый Граница(Основание.МоментВремени()));
	Иначе
		Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени()));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Отдел", ОтделЗакупа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Отказ = Истина;
		Сообщить("Не хватает товара " + ВыборкаДетальныеЗаписи.НоменклатураПредставление + " в количестве " + -ВыборкаДетальныеЗаписи.КоличествоОстаток + " для перемещения");
		
	КонецЦикла;


	Движения.Себестоимость.Записывать = Истина;
	Движения.Себестоимость.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Себестоимость");
	ЭлементБлокировки.УстановитьЗначение("Партия", ОтделЗакупа);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ДанныеДок.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВТ_ДанныеДок.КоличествоДок) КАК КоличествоДок,
	|	СУММА(ЕСТЬNULL(СебестоимостьОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	|	СУММА(ЕСТЬNULL(СебестоимостьСумма.КоличествоОстаток, 0)) КАК КоличествоОстатокСебестоимость,
	|	СУММА(ЕСТЬNULL(СебестоимостьСумма.СуммаОстаток, 0)) КАК СуммаОстаток,
	|	ВТ_ДанныеДок.Номенклатура.Представление КАК НоменклатураПредставление
	|ИЗ
	|	ВТ_ДанныеДок КАК ВТ_ДанныеДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Себестоимость.Остатки(
	|				&МоментВремени,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТ_ДанныеДок.Номенклатура
	|						ИЗ
	|							ВТ_ДанныеДок)
	|					И Партия = &ОтделЗакупок) КАК СебестоимостьОстатки
	|		ПО ВТ_ДанныеДок.Номенклатура = СебестоимостьОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Себестоимость.Остатки(
	|				&МоментВремени,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТ_ДанныеДок.Номенклатура
	|						ИЗ
	|							ВТ_ДанныеДок)
	|					И Партия.ВидПодразделения = &ВидОтделЗакупок) КАК СебестоимостьСумма
	|		ПО ВТ_ДанныеДок.Номенклатура = СебестоимостьСумма.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДок.Номенклатура,
	|	ВТ_ДанныеДок.Номенклатура.Представление";
	Если ЗначениеЗаполнено(Основание) Тогда
		Запрос.УстановитьПараметр("МоментВремени", Основание.МоментВремени());
	Иначе
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	КонецЕсли;
	Запрос.УстановитьПараметр("ОтделЗакупок", ОтделЗакупа);
	Запрос.УстановитьПараметр("ВидОтделЗакупок", Перечисления.ВидыПодразделений.ОтделЗакупок);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.КоличествоДок > ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
			
			Отказ = Истина;
			Сообщить("Не хватает партий товара " + ВыборкаДетальныеЗаписи.НоменклатураПредставление + " для перемещения в торговую точку! Не хватает в кол-ве: " + (ВыборкаДетальныеЗаписи.КоличествоДок - ВыборкаДетальныеЗаписи.КоличествоОстаток));
			Продолжить;
			
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			КоличествоОтдела = МИН(ВыборкаДетальныеЗаписи.КоличествоДок, ВыборкаДетальныеЗаписи.КоличествоОстаток);
			СуммаОтдела = ?(КоличествоОтдела = ВыборкаДетальныеЗаписи.КоличествоОстатокСебестоимость,   
			ВыборкаДетальныеЗаписи.СуммаОстаток, 
			ВыборкаДетальныеЗаписи.СуммаОстаток / ВыборкаДетальныеЗаписи.КоличествоОстатокСебестоимость * КоличествоОтдела);
			
			Движение = Движения.Себестоимость.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Партия = ОтделЗакупа;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			
			Движение.Количество = КоличествоОтдела;
			Движение.Сумма = СуммаОтдела;
			
			Движение = Движения.Себестоимость.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Партия = ТорговаяТочка;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Количество = КоличествоОтдела;
			Движение.Сумма = СуммаОтдела;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
