
&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбработатьВыбор", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	     
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбор(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Строка") И СтрНайти(Результат, "tempstorage") > 0 Тогда
		ОбработатьВыборНаСервере(Результат);
	КонецЕсли;
	
	     
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборНаСервере(Адрес) Экспорт
	
	ДанныеТЧ = ПолучитьИзВременногоХранилища(Адрес);
	
	Для каждого СтрокаТЧ из ДанныеТЧ Цикл
		
		НовСтр = Объект.СписокНоменклатуры.Добавить();
		НовСтр.Номенклатура = СтрокаТЧ.Номенклатура;
		НовСтр.Количество = СТрокаТЧ.Количество;
		
	КонецЦикла;
	
КонецПроцедуры
