
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
		
		ИмяПользователя = ИмяПользователя();
		
		ПользовательИБ = Справочники.ФизическиеЛица.НайтиПоНаименованию(ИмяПользователя);
		Если НЕ ЗначениеЗаполнено(ПользовательИБ) Тогда
			
			ПользовательОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ПользовательОбъект.Код = ИмяПользователя;
			ПользовательОбъект.Наименование = ИмяПользователя;
			ПользовательОбъект.Записать();
			
			ПользовательИБ = ПользовательОбъект.Ссылка;
		КонецЕсли;
		ПараметрыСеанса.ТекущийПользователь = ПользовательИБ;
	КонецЕсли;
	
	
КонецПроцедуры
