Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, Подразделение, Сотрудник) Экспорт 
	
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.Сотрудник.Установить(Сотрудник);
	Набор.Отбор.Подразделение.Установить(Подразделение);
	Набор.Записать();
	
	Дат = ДатаНачала;
	КоличествоИтераций = 32; // 4 15тки в часе на 8 часов
	ЧислоСекундВСутках = 86400;
	ИнтервалВДне = 15*60;
	Пока Дат <= ДатаОкончания Цикл
		
		Для Итерация = 1 По КоличествоИтераций Цикл
			Запись = Набор.Добавить();
			Запись.Подразделение = Подразделение;
			Запись.Сотрудник = Сотрудник;
			Запись.Дата = Дат + (Итерация - 1)*ИнтервалВДне;
			Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				Запись.Значение = 0;
				Запись.ЗначениеМинуты = 0;
			Иначе	          
				Запись.Значение = 0.25;
				Запись.ЗначениеМинуты = 15;
			КонецЕсли; 
			
		КонецЦикла;
		
		Дат = Дат + ЧислоСекундВСутках;
	
	КонецЦикла; 
	Набор.Записать();
	
КонецПроцедуры
