
&НаКлиенте
Процедура ОбновитьОтображениеТабЧастиОтработанноеВремя()
	
	ДнейВМесяце = День(КонецМесяца(Объект.ПериодРегистрации)); 
	
	Для СЧ = 1 По 31 Цикл
		
		ИмяКолонки = "ОтработанноеВремя_" + Формат(СЧ, "ЧГ=");
		Элементы[ИмяКолонки].СписокВыбора.очистить();
		Если Сч > ДнейВМесяце Тогда
			
			Элементы[ИмяКолонки].Видимость = Ложь;
			
		Иначе
			
			Элементы[ИмяКолонки].СписокВыбора.Добавить("8", "8");
			Элементы[ИмяКолонки].СписокВыбора.Добавить("К", "К");
			Элементы[ИмяКолонки].СписокВыбора.Добавить("", "");	
			
			Элементы[ИмяКолонки].Видимость = Истина;
			
		КонецЕсли;
		
		Элементы[ИмяКолонки].РедактированиеТекста = Ложь;
		Элементы[ИмяКолонки].РежимВыбораИзСписка = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	
	Объект.ОтработанноеВремя.Очистить();
	ОбновитьОтображениеТабЧастиОтработанноеВремя();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображениеТабЧастиОтработанноеВремя();
КонецПроцедуры

