&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	Отказ = Ложь;
	ПризнакСсылкаНаПриходДенег = "e1cib/data/Документ.ПриходДенег?";
	НаборКомментариев = СтрРазделить(Объект.Комментарий, " ", Ложь);
	ПризнакСсылка = "e1cib/data/";
	ДокументовНаПриходДенег = 0;
	ПрочиеСсылки = 0;
	Для каждого СтрокаКоммент Из НаборКомментариев Цикл
	
		Если СтрНачинаетсяС(СтрокаКоммент, ПризнакСсылкаНаПриходДенег) Тогда
		
			ДокументовНаПриходДенег = ДокументовНаПриходДенег + 1;
			
		ИначеЕсли СтрНачинаетсяС(СтрокаКоммент, ПризнакСсылка) Тогда
			
			ПрочиеСсылки = ПрочиеСсылки + 1;

		КонецЕсли;
	
	КонецЦикла;
	
	Если ДокументовНаПриходДенег > 1 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Навигационная ссылка может быть только 1!";
		Сообщение.Поле = "Объект.Комментарий";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если ПрочиеСсылки > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Навигационная ссылка может быть только на документ приход денег!";
		Сообщение.Поле = "Объект.Комментарий";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Объект.Комментарий = СтарыйКомментарий;
	Иначе
		СтарыйКомментарий = Объект.Комментарий;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СтарыйКомментарий = ТекущийОбъект.Комментарий;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПризнакСсылкаНаПриходДенег = "e1cib/data/Документ.ПриходДенег?";
	СсылкиНаПриходДенег = СтрРазделить(Объект.Комментарий, ПризнакСсылкаНаПриходДенег);
	Если СсылкиНаПриходДенег.Количество() < 2 Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	НаборКомментариев = СтрРазделить(Объект.Комментарий, " ");
	Для каждого СтрокаКоммент Из НаборКомментариев Цикл
	
		Если СтрНачинаетсяС(СтрокаКоммент, ПризнакСсылкаНаПриходДенег) Тогда
		
			ПерейтиПоНавигационнойСсылке(СтрокаКоммент);
			Прервать;
		
		КонецЕсли;
	
	КонецЦикла;

	
КонецПроцедуры
