
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Взаиморасчеты Приход
	Движения.Взаиморасчеты.Записывать = Истина;
	
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Документ = Ссылка;
	Движение.Сумма = СуммаПоДокументу;

	Движения.Взаиморасчеты.БлокироватьДляИзменения = Истина;
	
	Движения.Взаиморасчеты.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.Документ КАК Документ,
	|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВзаиморасчетыОстатки.Документ.Дата КАК ДокументДата,
	|	ВзаиморасчетыОстатки.Контрагент.СрокКредита КАК КонтрагентСрокКредита,
	|	ВзаиморасчетыОстатки.Контрагент.СуммаКредита КАК КонтрагентСуммаКредита
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&МоментВремени, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВзаиморасчетыОстатки.Документ.МоментВремени
	|ИТОГИ
	|	СУММА(СуммаОстаток),
	|	СУММА(КонтрагентСуммаКредита)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();
	
	ТекущаяСуммаКредита = ВыборкаОбщийИтог.СуммаОстаток;
	
	ВыборкаДетальныеЗаписи = ВыборкаОбщийИтог.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ЧислоСекундВСутках = 86400;
	
	ТекущийСрокКредита = (НачалоДня(Дата) - НачалоДня(ВыборкаДетальныеЗаписи.ДокументДата)) / ЧислоСекундВСутках;
	
	Если ВыборкаДетальныеЗаписи.КонтрагентСрокКредита <> 0
		И ВыборкаДетальныеЗаписи.КонтрагентСрокКредита < ТекущийСрокКредита Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Превышен срок кредита по контрагенту";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Если ВыборкаДетальныеЗаписи.КонтрагентСуммаКредита <> 0
		И ВыборкаДетальныеЗаписи.КонтрагентСуммаКредита < ТекущийСрокКредита Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Превышена сумма кредита по контрагенту";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
