
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ЧислоСекундВСутках = 86400;
	
	Движения.РаботчееВремяСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		
		Для СЧ = 1 ПО 7 Цикл
			
			ИмяКолонки = "_Д" + сч;
			Если ТекСтрокаСотрудники[ИмяКолонки] Тогда
				Движение = Движения.РаботчееВремяСотрудников.Добавить();
				Движение.Период = ПериодС + (СЧ - 1) * ЧислоСекундВСутках;
				Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
				Движение.Количество = 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
