
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	 ОбновитьКартуМаршрута(ТекущийОбъект);
	 
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ОбновитьКартуМаршрута(ТекОбъект);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКарту(Команда)
	ОбновитьКартуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуМаршрута(ТекущийОбъект)
	
	Карта = ТекущийОбъект.ПолучитьКартуМаршрута();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
ОбновитьКартуМаршрута(ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗадачаВыполнена" и Объект.Ссылка = Параметр Тогда
		Прочитать();
		ОбновитьКартуНаСервере();
	КонецЕсли;
	
КонецПроцедуры


