
&НаСервере
Процедура ЗаполнитьНаСервере()

	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапрлатаКВыплатеОстатки.Сотрудник КАК Сотрудник,
		|	ЗапрлатаКВыплатеОстатки.ВидРасчета КАК ВидРасчета,
		|	ЗапрлатаКВыплатеОстатки.РазмерОстаток КАК Размер
		|ИЗ
		|	РегистрНакопления.ЗапрлатаКВыплате.Остатки(&Дата, Подразделение = &Подразделение) КАК ЗапрлатаКВыплатеОстатки";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НовСтр = Объект.Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
