
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
		
		ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
		
		ПользовательИБ = Справочники.ФизическиеЛица.НайтиПоКоду(ИмяПользователя);
		Если Не ЗначениеЗаполнено(ПользовательИБ) Тогда
			
			ПользовательОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ПользовательОбъект.Код = ИмяПользователя;
			ПользовательОбъект.Наименование = ИмяПользователя;
			
			ПользовательОбъект.Записать();
			
			ПользовательИБ = ПользовательОбъект.Ссылка;
			
		КонецЕсли;
		
		ПараметрыСеанса.ТекущийПользователь = ПользовательИБ;
		
	КонецЕсли;
	
КонецПроцедуры
