
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
		
		ТекПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		
		ТекПользовательБД = Справочники.ФизическиеЛица.НайтиПоКоду(ТекПользовательИБ.Имя);
		Если НЕ ЗначениеЗаполнено(ТекПользовательБД) Тогда
			
			ТекПользовательБДОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ТекПользовательБДОбъект.Код = ТекПользовательИБ.Имя;
			ТекПользовательБДОбъект.Наименование = ТекПользовательИБ.Имя;
			ТекПользовательБДОбъект.Записать();
			
			ТекПользовательБД = ТекПользовательБДОбъект.Ссылка;
			
		КонецЕсли;
		
		ПараметрыСеанса.ТекущийПользователь = ТекПользовательБД;
		
	КонецЕсли;
	
	
КонецПроцедуры
