
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ДанныеТабеля 
	Движения.ДанныеТабеля.Записывать = Истина;
	
	Для Каждого ТекСтрокаФактическоеВремя Из ФактическоеВремя Цикл
		
		Для каждого Реквизит Из Метаданные().ТабличныеЧасти["ФактическоеВремя"].Реквизиты Цикл
			
			Если Реквизит.Имя <> "Сотрудник" Тогда
				
				ОтработаноДней = ?(ТекСтрокаФактическоеВремя[Реквизит.Имя] = " Н" 
				ИЛИ Не ЗначениеЗаполнено(ТекСтрокаФактическоеВремя[Реквизит.Имя]), 0, 1);
				Если ОтработаноДней > 0 Тогда
					Движение = Движения.ДанныеТабеля.Добавить();
					Движение.Период = НачалоНедели + ((Число(Сред(Реквизит.Имя, 2)) - 1) * 86400);
					Движение.Сотрудник = ТекСтрокаФактическоеВремя.Сотрудник;
					Движение.Подразделение = Подразделение;
					Движение.ОтработаноЧасов = 
					?(ТекСтрокаФактическоеВремя[Реквизит.Имя] = " Н" 
					ИЛИ Не ЗначениеЗаполнено(ТекСтрокаФактическоеВремя[Реквизит.Имя]), 0, 
					Число(ТекСтрокаФактическоеВремя[Реквизит.Имя]));                                  
					
					Движение.ОтработаноДней = ОтработаноДней;	
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
