
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Продажи.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продажи.Период КАК Период
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Регистратор = &Регистратор
	|	И Продажи.Номенклатура = &Номенклатура";
	ЗАпрос.УстановитьПараметр("Регистратор", Документ);
	ЗАпрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найдено продаж по комбинации ""Документ + Товар""";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ВыборкаПериод = РезультатЗапроса.Выбрать();
	ВыборкаПериод.Следующий();
	
	Движение = Движения.Продажи.Добавить();
	Движение.Период = ВыборкаПериод.Период + 1;
	Движение.Номенклатура = Номенклатура;
	Движение.Себестоимость = Сумма;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
