Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Записать();
	
	ЧислоСекундВСутках = 86400;
	
	ВыходныеДни = "6,7";
	Дат = ДатаНачала;
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Смена = Справочники.Смены.Пятидневка;
		Запись.Дата = Дат;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.Значение = 0;
			Запись.ЗначениеДни = 0;
		Иначе	          
			Запись.Значение = 8;
			Запись.ЗначениеДни = 1;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	
	сч = 1;
	Дат = ДатаНачала;
	Пока Дат <= ДатаОкончания Цикл
		
		Запись = Набор.Добавить();
		Запись.Смена = Справочники.Смены.Смена1;
		Запись.Дата = Дат;
		Если сч = 1 Тогда
			Запись.Значение = 24;
			Запись.ЗначениеДни = 1;
		Иначе	          
			Запись.Значение = 0;
			Запись.ЗначениеДни = 0;
		КонецЕсли; 
		
		Запись = Набор.Добавить();
		Запись.Смена = Справочники.Смены.Смена2;
		Запись.Дата = Дат;
		Если сч = 2 Тогда
			Запись.Значение = 24;
			Запись.ЗначениеДни = 1;
		Иначе	          
			Запись.Значение = 0;
			Запись.ЗначениеДни = 0;
		КонецЕсли; 
		
		Запись = Набор.Добавить();
		Запись.Смена = Справочники.Смены.Смена3;
		Запись.Дата = Дат;
		Если сч = 3 Тогда
			Запись.Значение = 24;
			Запись.ЗначениеДни = 1;
		Иначе	          
			Запись.Значение = 0;
			Запись.ЗначениеДни = 0;
		КонецЕсли; 
		
		Дат = Дат + ЧислоСекундВСутках;
		Если сч < 3 Тогда
			сч = сч + 1;
		Иначе
			сч = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры
