
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК КоличествоДок,
	|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК СуммаДок,
	|	РасходнаяНакладнаяСписокНоменклатуры.Договор КАК Договор,
	|	РасходнаяНакладнаяСписокНоменклатуры.Договор.ПроцентВознагражденя КАК ПроцентВознагражденя
	|ПОМЕСТИТЬ Вт_ДанныеДок
	|ИЗ
	|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
	|	РасходнаяНакладнаяСписокНоменклатуры.Договор,
	|	РасходнаяНакладнаяСписокНоменклатуры.Договор.ПроцентВознагражденя
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_ДанныеДок.Номенклатура КАК Номенклатура,
	|	Вт_ДанныеДок.Номенклатура.Представление КАК НоменклатураПредставление,
	|	МАКСИМУМ(Вт_ДанныеДок.КоличествоДок) КАК КоличествоДок,
	|	МАКСИМУМ(Вт_ДанныеДок.СуммаДок) КАК СуммаДок,
	|	СУММА(ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	|	СУММА(ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
	|	МАКСИМУМ(Вт_ДанныеДок.ПроцентВознагражденя) КАК ПроцентВознагражденя,
	|	Вт_ДанныеДок.Договор КАК Договор,
	|	Вт_ДанныеДок.Договор.Представление КАК ДоговорПредставление
	|ИЗ
	|	Вт_ДанныеДок КАК Вт_ДанныеДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|				&МоментВремени,
	|				Договор В
	|						(ВЫБРАТЬ
	|							ВТ_ДанныеДок.Договор
	|						ИЗ
	|							ВТ_ДанныеДок)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТ_ДанныеДок.Номенклатура
	|						ИЗ
	|							ВТ_ДанныеДок)) КАК ОстаткиНоменклатурыОстатки
	|		ПО Вт_ДанныеДок.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
	|			И Вт_ДанныеДок.Договор = ОстаткиНоменклатурыОстатки.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт_ДанныеДок.Номенклатура,
	|	Вт_ДанныеДок.Договор,
	|	Вт_ДанныеДок.Номенклатура.Представление,
	|	Вт_ДанныеДок.Договор.Представление";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.КоличествоДок > ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда 
			Отказ = Истина;
			Сообщить("По договору: " + ВыборкаДетальныеЗаписи.ДоговорПредставление + " по номенклатуре " + ВыборкаДетальныеЗаписи.НоменклатураПредставление + "не хватает: " + (ВыборкаДетальныеЗаписи.КоличествоДок - ВыборкаДетальныеЗаписи.КоличествоОстаток));
			Продолжить;
			
		КонецЕсли;
		
		//оставляем, чтобы вывести сообщения обо всех ошибках
		СуммаСписания = ?(ВыборкаДетальныеЗаписи.КоличествоДок = ВыборкаДетальныеЗаписи.КоличествоОстаток,
			ВыборкаДетальныеЗаписи.СуммаОстаток,
			ВыборкаДетальныеЗаписи.СуммаОстаток / ВыборкаДетальныеЗаписи.КоличествоОстаток * ВыборкаДетальныеЗаписи.КоличествоДок);
		
		КонтролируемаяСумма = ?(ВыборкаДетальныеЗаписи.КоличествоОстаток > 0, 
		ВыборкаДетальныеЗаписи.СуммаОстаток / ВыборкаДетальныеЗаписи.КоличествоОстаток *  ВыборкаДетальныеЗаписи.КоличествоДок,
		0);
		Если СуммаСписания < КонтролируемаяСумма Тогда 
			Отказ = Истина;
			Сообщить("По номенклатуре " + ВыборкаДетальныеЗаписи.НоменклатураПредставление + " сумма продажи: " + ВыборкаДетальныеЗаписи.СуммаДок + " ниже контролируемой суммы: " + КонтролируемаяСумма);
			Продолжить;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			// регистр ОстаткиНоменклатуры расход 
			Движение = Движения.ОстаткиНоменклатуры.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Договор = ВыборкаДетальныеЗаписи.Договор;
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоДок;
			
			
			Движение.Сумма = СуммаСписания;
			
			
			// регистр Выручка 
			СуммаВознаграждения = Окр(ВыборкаДетальныеЗаписи.СуммаДок * (ВыборкаДетальныеЗаписи.ПроцентВознагражденя/100), 2);
			СуммаВыплаты        = ВыборкаДетальныеЗаписи.СуммаДок - СуммаВознаграждения;
			
			Движение = Движения.Выручка.Добавить();
			Движение.Период = Дата;
			Движение.Менеджер = Менеджер;
			Движение.Договор = ВыборкаДетальныеЗаписи.Договор;
			Движение.СуммаПродажи = ВыборкаДетальныеЗаписи.СуммаДок;
			Движение.СуммаВыплаты = СуммаВыплаты;
			Движение.СуммаВознаграждения = СуммаВознаграждения;
			
			// регистр ВзаиморасчетыСКоммитентом Приход
			Движение = Движения.ВзаиморасчетыСКоммитентом.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Договор = ВыборкаДетальныеЗаписи.Договор;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоДок;
			Движение.СуммаПродажи = ВыборкаДетальныеЗаписи.СуммаДок;
			Движение.СуммаВыплаты = СуммаВыплаты;
			
		КонецЕсли;
		
	КонецЦикла;                                

	Если НЕ Отказ Тогда
		Движения.ВзаиморасчетыСКоммитентом.Записать();
		Движения.Выручка.Записать();
		
		Движения.Записать();
		
	КонецЕсли;


	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
