
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Пробег Приход
	Движения.Пробег.Записывать = Истина;
	Для Каждого ТекСтрокаПробег Из Пробег Цикл
		Движение = Движения.Пробег.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаПробег.Сотрудник;
		Движение.Значение = ТекСтрокаПробег.Значение;
	КонецЦикла;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
