
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
		
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		Имя = ПользовательИБ.Имя;
		
		ПользовательБД = Справочники.ФизическиеЛица.НайтиПоКоду(Имя);
		Если НЕ ЗначениеЗаполнено(ПользовательБД) Тогда
			
			ОбъектБД = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ОбъектБД.Наименование = Имя;
			ОбъектБД.Код = Имя;
			ОбъектБД.Записать();
			
			ПользовательБД = ОбъектБД.Ссылка;
			
		КонецЕсли;
		
		ПараметрыСеанса.ТекущееФизЛицо = ПользовательБД;
		
	КонецЕсли;	
	
КонецПроцедуры
