&НаКлиенте
Процедура РезультатПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Для каждого ЭлемПеретаскивания из ПараметрыПеретаскивания.Значение Цикл
		
		ДобавитьТоварВКорзину(ЭлемПеретаскивания);
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Адрес = ПеренестиВДокументНаСервере();
	Закрыть(Адрес);
	
КонецПроцедуры

&НаСервере
Функция ПеренестиВДокументНаСервере()
	
	Возврат ПоместитьВоВременноеХранилище(Корзина.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура СписокВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.СписокВыбора.ТекущиеДанные;
	Если НЕ ТекДанные.ЭтоГруппа Тогда
		СтандартнаяОбработка = Ложь;
		ДобавитьТоварВКорзину(ВыбраннаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварВКорзину(ТоварСсылка)
	
	
	ПараметрыОтбора = Новый Структура("Номенклатура", ТоварСсылка); 
	СтрокиКорзины = Корзина.НайтиСтроки(ПараметрыОтбора);
	Если СтрокиКорзины.Количество() <> 0 Тогда
		
		СтрокаКорзины = СтрокиКорзины[0];
	Иначе
		
		СтрокаКорзины = Корзина.Добавить();
		СтрокаКорзины.Номенклатура = ТоварСсылка;
		
	КонецЕсли;
	
	СтрокаКорзины.Количество = СтрокаКорзины.Количество + 1;
	
	
	
КонецПроцедуры


