
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
		
		ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
		ТекФизЛицо = Справочники.ФизическиеЛица.НайтиПоНаименованию(ТекПользователь.Имя);
		Если НЕ ЗначениеЗаполнено(ТекФизЛицо) Тогда
			
			ФизЛицоОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ФизЛицоОбъект.Наименование = ТекПользователь.Имя;
			ФизЛицоОбъект.код = ТекПользователь.Имя;
			ФизЛицоОбъект.Записать();
			
			ТекФизЛицо = ФизЛицоОбъект.Ссылка;
			
		КонецЕсли;
		
		ПараметрыСеанса.ФизЛицо = ТекФизЛицо;
		
	КонецЕсли;
	
КонецПроцедуры
